var avroRegexData = {\npatterns: [FAIL_START\n\nvar AvroRegex = function() { this._init && this._init.apply(this, arguments); };\nAvroRegex.prototype = {parse: function (e) {
                e = this._fixString(e);
                for (var t = "", n = 0; n < e.length; ++n) {
                    for (
                        var r = n, i = n + 1, a = r - 1, o = !1, a = 0;
                        a < this.data.patterns.length;
                        ++a
                    ) {
                        var s = this.data.patterns[a],
                            i = n + s.find.length;
                        if (i <= e.length && e.substring(r, i) == s.find) {
                            if (((a = r - 1), "undefined" != typeof s.rules))
                                for (var l = 0; l < s.rules.length; ++l) {
                                    for (
                                        var c = s.rules[l], u = !0, p = 0, h = 0;
                                        h < c.matches.length;
                                        ++h
                                    ) {
                                        var d = c.matches[h],
                                            p = "suffix" === d.type ? i : a;
                                        if (
                                            ("undefined" == typeof d.negative &&
                                                ((d.negative = !1),
                                                    "!" === d.scope.charAt(0) &&
                                                    ((d.negative = !0),
                                                        (d.scope = d.scope.substring(1)))),
                                                "undefined" == typeof d.value && (d.value = ""),
                                                "punctuation" === d.scope)
                                        ) {
                                            if (
                                                !(
                                                    (0 > p && "prefix" === d.type) ||
                                                    (p >= e.length && "suffix" === d.type) ||
                                                    this._isPunctuation(e.charAt(p))
                                                ) ^ d.negative
                                            ) {
                                                u = !1;
                                                break;
                                            }
                                        } else if ("vowel" === d.scope) {
                                            if (
                                                !(
                                                    ((p >= 0 && "prefix" === d.type) ||
                                                        (p < e.length && "suffix" === d.type)) &&
                                                    this._isVowel(e.charAt(p))
                                                ) ^ d.negative
                                            ) {
                                                u = !1;
                                                break;
                                            }
                                        } else if ("consonant" === d.scope) {
                                            if (
                                                !(
                                                    ((p >= 0 && "prefix" === d.type) ||
                                                        (p < e.length && "suffix" === d.type)) &&
                                                    this._isConsonant(e.charAt(p))
                                                ) ^ d.negative
                                            ) {
                                                u = !1;
                                                break;
                                            }
                                        } else if ("exact" === d.scope) {
                                            var f;
                                            if (
                                                ("suffix" === d.type
                                                    ? ((p = i), (f = i + d.value.length))
                                                    : ((p = r - d.value.length), (f = r)),
                                                    !this._isExact(d.value, e, p, f, d.negative))
                                            ) {
                                                u = !1;
                                                break;
                                            }
                                        }
                                    }
                                    if (u) {
                                        ((t += c.replace + "(্[যবম])?(্?)([ঃঁ]?)"),
                                            (n = i - 1),
                                            (o = !0));
                                        break;
                                    }
                                }
                            if (1 == o) break;
                            ((t += s.replace + "(্[যবম])?(্?)([ঃঁ]?)"),
                                (n = i - 1),
                                (o = !0));
                            break;
                        }
                    }
                    o || (t += e.charAt(n));
                }
                return t;
            },
            _convertToUnicodeValue: function (e) {
                var t = "";
                e = p.utf8Decode(e);
                for (var n = 0; n < e.length; n++) {
                    var r = e.charCodeAt(n);
                    if (r >= 255) {
                        for (var r = r.toString(16), i = 4 - r.length, a = ""; i > 0; i--)
                            a += "0";
                        t += "\\u" + a + r;
                    } else t += e.charAt(n);
                }
                return t;
            },
            _fixString: function (e) {
                for (var t = "", n = 0; n < e.length; ++n) {
                    var r = e.charAt(n);
                    this._isIgnore(r) || (t += r.toLowerCase());
                }
                return t;
            },
            _isVowel: function (e) {
                return 0 <= this.data.vowel.indexOf(e.toLowerCase());
            },
            _isConsonant: function (e) {
                return 0 <= this.data.consonant.indexOf(e.toLowerCase());
            },
            _isPunctuation: function (e) {
                return !(this._isVowel(e) || this._isConsonant(e));
            },
            _isExact: function (e, t, n, r, i) {
                return (n >= 0 && r < t.length && t.substring(n, r) === e) ^ i;
            },
            _isIgnore: function (e) {
                return 0 <= this.data.ignore.indexOf(e.toLowerCase());
            },
            data: {
                patterns: [
                    {
                        find: "aa",
                        replace:
                            "(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))",
                        rules: [],
                    },
                    {
                        find: "au",
                        replace:
                            "(ঔ|ৌ(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))([উঊুূ]|(য়[ুূ])))",
                        rules: [],
                    },
                    {
                        find: "az",
                        replace:
                            "((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((জ|য|(জ়)|([‌‍]?্য)))?)",
                        rules: [],
                    },
                    {
                        find: "ai",
                        replace:
                            "(ঐ|ৈ|(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))([ইঈিী]|(য়[িী])))",
                        rules: [],
                    },
                    {
                        find: "a",
                        replace: "(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))",
                        rules: [],
                    },
                    {
                        find: "bbh",
                        replace:
                            "((ব?্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ব্?ব?)্?(হ|ঃ|(হ্‌?)))|(ব্?ব্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "bdh",
                        replace:
                            "((ব্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ব্?[দড])্?(হ|ঃ|(হ্‌?)))|(ব্?[দড]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "bhl",
                        replace:
                            "(((ভ|(ব্?(হ|ঃ|(হ্‌?))))্?ল)|(ব্?((হ|ঃ|(হ্‌?))্?ল))|(ব্?(হ|ঃ|(হ্‌?))্?ল))",
                        rules: [],
                    },
                    { find: "bh", replace: "(ভ|(ব্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "bb", replace: "(ব্?ব?)", rules: [] },
                    { find: "bd", replace: "(ব্?[দড])", rules: [] },
                    { find: "bv", replace: "(ব?্?ভ)", rules: [] },
                    { find: "b", replace: "ব", rules: [] },
                    {
                        find: "chchh",
                        replace:
                            "((চ্ছ)|((চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))্?(((চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))্?((হ|ঃ|(হ্‌?)))?)|([চছ]্?((হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?))))|([চছ]্?(হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?)))))|((চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))্?(হ|ঃ|(হ্‌?)))|([চছ]্?(হ|ঃ|(হ্‌?))্?[চছ]্?(হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "cch",
                        replace:
                            "(([চছ]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|([চছ]্?[চছ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "chh",
                        replace:
                            "(((চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))্?((হ|ঃ|(হ্‌?)))?)|([চছ]্?((হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?))))|([চছ]্?(হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "cng",
                        replace:
                            "((চ্ঞ)|([চছ]্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|([চছ]্?[নণঁঙঞং]্?(গ|(জ্ঞ)))|(([চছ]্?[নণঁঙঞং])্?(গ|(জ্ঞ))))",
                        rules: [],
                    },
                    { find: "ch", replace: "(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "ck", replace: "(ক|([চছ]্?ক))", rules: [] },
                    { find: "cc", replace: "([চছ]্?[চছ]?)", rules: [] },
                    { find: "cn", replace: "([চছ]্?[নণঁঙঞং])", rules: [] },
                    { find: "c", replace: "([চছ])", rules: [] },
                    {
                        find: "dhm",
                        replace:
                            "(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?ম)|([দড]্?((হ|ঃ|(হ্‌?))্?ম))|([দড]্?(হ|ঃ|(হ্‌?))্?ম))",
                        rules: [],
                    },
                    {
                        find: "dhn",
                        replace:
                            "(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([দড]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([দড]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    {
                        find: "dbh",
                        replace:
                            "(([দড]্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|(([দড]্?ব)্?(হ|ঃ|(হ্‌?)))|([দড]্?ব্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ddh",
                        replace:
                            "(([দড]?্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([দড]্?[দড]?)্?(হ|ঃ|(হ্‌?)))|([দড]্?[দড]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "dgh",
                        replace:
                            "(([দড]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|(([দড]্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|([দড]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "db", replace: "([দড]্?ব)", rules: [] },
                    { find: "dd", replace: "([দড]্?[দড]?)", rules: [] },
                    { find: "dg", replace: "([দড]্?(গ|(জ্ঞ)))", rules: [] },
                    { find: "dh", replace: "(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "d", replace: "([দড])", rules: [] },
                    {
                        find: "ey",
                        replace:
                            "(এ|ই|ে|(েই)|(এই)|ঈ|ী|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(য়|(ইয়)|([‌‍]?্য))))",
                        rules: [],
                    },
                    {
                        find: "ee",
                        replace:
                            "(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))",
                        rules: [],
                    },
                    { find: "e", replace: "((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))", rules: [] },
                    { find: "ff", replace: "(ফ্?ফ?)", rules: [] },
                    { find: "f", replace: "ফ", rules: [] },
                    {
                        find: "ggh",
                        replace:
                            "((((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "gdh",
                        replace:
                            "(((গ|(জ্ঞ))্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?[দড]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ghn",
                        replace:
                            "(((ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((গ|(জ্ঞ))্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    { find: "gh", replace: "(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    {
                        find: "gg",
                        replace: "((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))",
                        rules: [],
                    },
                    { find: "g", replace: "(গ|(জ্ঞ))", rules: [] },
                    { find: "hl", replace: "((হ|ঃ|(হ্‌?))্?ল)", rules: [] },
                    { find: "hh", replace: "((হ|ঃ|(হ্‌?))্?(হ|ঃ|(হ্‌?)))", rules: [] },
                    { find: "hm", replace: "((হ|ঃ|(হ্‌?))্?ম)", rules: [] },
                    { find: "hn", replace: "((হ|ঃ|(হ্‌?))্?[নণঁঙঞং])", rules: [] },
                    { find: "h", replace: "(হ|ঃ|(হ্‌?))", rules: [] },
                    {
                        find: "ia",
                        replace:
                            "((ঞা)|(([ইঈিী]|(য়[িী]))(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))))",
                        rules: [],
                    },
                    { find: "i", replace: "([ইঈিী]|(য়[িী]))", rules: [] },
                    {
                        find: "jng",
                        replace:
                            "((জ্ঞ)|(([জয]|(জ়))্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|(([জয]|(জ়))্?[নণঁঙঞং]্?(গ|(জ্ঞ))))",
                        rules: [],
                    },
                    {
                        find: "jjh",
                        replace:
                            "(((([জয]|(জ়)))?্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(হ্য)|(((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))্?(হ|ঃ|(হ্‌?)))|(([জয]|(জ়))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "jj",
                        replace: "((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))",
                        rules: [],
                    },
                    { find: "jh", replace: "(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "j", replace: "([জয]|(জ়))", rules: [] },
                    {
                        find: "kshm",
                        replace:
                            "((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম)))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?ম))",
                        rules: [],
                    },
                    {
                        find: "kkhm",
                        replace:
                            "((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?ম)|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?ম)|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?ম))",
                        rules: [],
                    },
                    {
                        find: "kshn",
                        replace:
                            "((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    {
                        find: "kkhn",
                        replace:
                            "((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    {
                        find: "ksh",
                        replace:
                            "((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "kkh",
                        replace:
                            "((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "kxm",
                        replace:
                            "((((ক্ষ)|(ক্?((ক্স)|ষ)))্?ম)|(ক্?(((ক্স)|ষ)্?ম))|(ক্?((ক্স)|ষ)্?ম))",
                        rules: [],
                    },
                    {
                        find: "kxn",
                        replace:
                            "((((ক্ষ)|(ক্?((ক্স)|ষ)))্?[নণঁঙঞং])|(ক্?(((ক্স)|ষ)্?[নণঁঙঞং]))|(ক্?((ক্স)|ষ)্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    { find: "kh", replace: "(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "kk", replace: "(ক্?ক?)", rules: [] },
                    { find: "ks", replace: "(ক্?[সশষ])", rules: [] },
                    { find: "kx", replace: "((ক্ষ)|(ক্?((ক্স)|ষ)))", rules: [] },
                    { find: "k", replace: "ক", rules: [] },
                    {
                        find: "lkh",
                        replace:
                            "((ল্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ল্?ক)্?(হ|ঃ|(হ্‌?)))|(ল্?ক্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "lgh",
                        replace:
                            "((ল্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((ল্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|(ল্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "lph",
                        replace:
                            "((ল্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ল্?প)্?(হ|ঃ|(হ্‌?)))|(ল্?প্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ldh",
                        replace:
                            "((ল্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ল্?[দড])্?(হ|ঃ|(হ্‌?)))|(ল্?[দড]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "lbh",
                        replace:
                            "((ল্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ল্?ব)্?(হ|ঃ|(হ্‌?)))|(ল্?ব্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "ll", replace: "((হ্ল)|(ল?্?ল)|(ল্?ল))", rules: [] },
                    { find: "lk", replace: "(ল্?ক)", rules: [] },
                    { find: "lg", replace: "(ল্?(গ|(জ্ঞ)))", rules: [] },
                    { find: "lp", replace: "(ল্?প)", rules: [] },
                    { find: "ld", replace: "(ল্?[দড])", rules: [] },
                    { find: "lb", replace: "(ল্?ব)", rules: [] },
                    { find: "l", replace: "ল", rules: [] },
                    {
                        find: "mbh",
                        replace:
                            "((ম্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ম্?ব)্?(হ|ঃ|(হ্‌?)))|(ম্?ব্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "mph",
                        replace:
                            "((ম্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ম্?প)্?(হ|ঃ|(হ্‌?)))|(ম্?প্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "mth",
                        replace:
                            "((ম্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|((ম্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|(ম্?[তটৎ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "mm", replace: "((হ্ম)|(ম্?ম?))", rules: [] },
                    { find: "mb", replace: "(ম্?ব)", rules: [] },
                    { find: "mp", replace: "(ম্?প)", rules: [] },
                    { find: "mt", replace: "(ম্?[তটৎ])", rules: [] },
                    { find: "m", replace: "ম", rules: [] },
                    {
                        find: "ngksh",
                        replace:
                            "(((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngkkh",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?ক?)্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?ক্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngch",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "nggh",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?((((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|(((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngkx",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?((ক্স)|ষ)))",
                        rules: [],
                    },
                    {
                        find: "ngjh",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngkh",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?(হ|ঃ|(হ্‌?)))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "nsh",
                        replace:
                            "(([নণঁঙঞং]্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?[সশষ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ndh",
                        replace:
                            "(([নণঁঙঞং]্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[দড])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[দড]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "nkh",
                        replace:
                            "(([নণঁঙঞং]্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(((ঙ্ক)|([নণঁঙঞং]্?ক))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?ক্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "nth",
                        replace:
                            "(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngj",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))",
                        rules: [],
                    },
                    {
                        find: "ngm",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ম)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ম))",
                        rules: [],
                    },
                    {
                        find: "ngg",
                        replace:
                            "((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))",
                        rules: [],
                    },
                    {
                        find: "ngx",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্স)|ষ)))",
                        rules: [],
                    },
                    {
                        find: "ngk",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))",
                        rules: [],
                    },
                    {
                        find: "ngh",
                        replace:
                            "((ঙ্ঘ)|([নণঁঙঞং]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "nch",
                        replace:
                            "(([নণঁঙঞং]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|(((ঞ্চ)|([নণঁঙঞং]্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[চছ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "njh",
                        replace:
                            "(([নণঁঙঞং]্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ngc",
                        replace:
                            "(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))",
                        rules: [],
                    },
                    { find: "nc", replace: "((ঞ্চ)|([নণঁঙঞং]্?[চছ]))", rules: [] },
                    {
                        find: "nn",
                        replace: "((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))",
                        rules: [],
                    },
                    {
                        find: "ng",
                        replace: "(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))",
                        rules: [],
                    },
                    { find: "nk", replace: "((ঙ্ক)|([নণঁঙঞং]্?ক))", rules: [] },
                    { find: "nj", replace: "((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))", rules: [] },
                    { find: "nd", replace: "([নণঁঙঞং]্?[দড])", rules: [] },
                    { find: "nt", replace: "([নণঁঙঞং]্?[তটৎ])", rules: [] },
                    { find: "n", replace: "([নণঁঙঞং])", rules: [] },
                    {
                        find: "oo",
                        replace:
                            "((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))",
                        rules: [],
                    },
                    {
                        find: "oi",
                        replace: "(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))",
                        rules: [],
                    },
                    {
                        find: "ou",
                        replace: "(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))",
                        rules: [],
                    },
                    {
                        find: "o",
                        replace: "(([ওোঅ]|(অ্য)|(য়ো?))?)",
                        rules: [
                            {
                                matches: [
                                    {
                                        type: "prefix",
                                        scope: "punctuation",
                                        value: "",
                                        negative: "FALSE",
                                    },
                                ],
                                replace: "([ওোঅ]|(অ্য)|(য়ো?))",
                            },
                        ],
                    },
                    {
                        find: "phl",
                        replace:
                            "(((ফ|(প্?(হ|ঃ|(হ্‌?))))্?ল)|(প্?((হ|ঃ|(হ্‌?))্?ল))|(প্?(হ|ঃ|(হ্‌?))্?ল))",
                        rules: [],
                    },
                    { find: "ph", replace: "(ফ|(প্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "pp", replace: "(প্?প?)", rules: [] },
                    { find: "p", replace: "প", rules: [] },
                    { find: "qq", replace: "(ক্?ক?)", rules: [] },
                    { find: "q", replace: "ক", rules: [] },
                    {
                        find: "rri",
                        replace: "(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))",
                        rules: [],
                    },
                    {
                        find: "ri",
                        replace: "(ঋ|ৃ|(হৃ)|(([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))",
                        rules: [],
                    },
                    {
                        find: "rh",
                        replace: "((([রড়ঢ়]|(হ্র)))|(([রড়ঢ়]|(হ্র))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "r", replace: "([রড়ঢ়]|(হ্র))", rules: [] },
                    {
                        find: "shsh",
                        replace:
                            "((((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))?্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[সশষ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "ssh",
                        replace:
                            "(([সশষ]?্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|([সশষ]্?[সশষ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "shm",
                        replace:
                            "(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম))",
                        rules: [],
                    },
                    {
                        find: "shn",
                        replace:
                            "(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))",
                        rules: [],
                    },
                    { find: "ss", replace: "([সশষ]্?[সশষ]?)", rules: [] },
                    { find: "sh", replace: "(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "s", replace: "([সশষ])", rules: [] },
                    {
                        find: "thth",
                        replace:
                            "((ত্থ)|(((থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))?্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|([তটৎ]্?(হ|ঃ|(হ্‌?))্?[তটৎ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    {
                        find: "tth",
                        replace:
                            "(([তটৎ]?্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([তটৎ]্?[তটৎ]?)্?(হ|ঃ|(হ্‌?)))|([তটৎ]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "t``", replace: "ৎ", rules: [] },
                    {
                        find: "tth",
                        replace:
                            "((([তটৎ]?(্?)(থ|ঠ|([তটৎ](্?)(হ|ঃ|(হ্‌?)))))|(([তটৎ](্?)[তটৎ]?)(্?)(হ|ঃ|(হ্‌?)))|([তটৎ](্?)[তটৎ](্?)(হ|ঃ|(হ্‌?)))))",
                        rules: [],
                    },
                    { find: "tt", replace: "([তটৎ]্?[তটৎ]?)", rules: [] },
                    { find: "th", replace: "(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    { find: "t", replace: "([তটৎ])", rules: [] },
                    {
                        find: "uu",
                        replace: "(ঊ|ূ|(([উঊুূ]|(য়[ুূ]))(([উঊুূ]|(য়[ুূ])))?))",
                        rules: [],
                    },
                    { find: "u", replace: "([উঊুূ]|(য়[ুূ]))", rules: [] },
                    { find: "vv", replace: "(ভ্?ভ?)", rules: [] },
                    { find: "v", replace: "ভ", rules: [] },
                    { find: "w", replace: "(ও|(ওয়)|(্ব))", rules: [] },
                    { find: "xm", replace: "(((ক্স)|ষ)্?ম)", rules: [] },
                    { find: "xn", replace: "(((ক্স)|ষ)্?[নণঁঙঞং])", rules: [] },
                    { find: "x", replace: "((ক্স)|ষ)", rules: [] },
                    { find: "y", replace: "(য়|(ইয়)|([‌‍]?্য))", rules: [] },
                    {
                        find: "zzh",
                        replace:
                            "((হ্য)|((জ|য|(জ়)|([‌‍]?্য))্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(((হ্য)|((জ|য|(জ়)|([‌‍]?্য))্?((জ|য|(জ়)|([‌‍]?্য)))?))্?(হ|ঃ|(হ্‌?)))|((জ|য|(জ়)|([‌‍]?্য))্?(জ|য|(জ়)|([‌‍]?্য))্?(হ|ঃ|(হ্‌?))))",
                        rules: [],
                    },
                    { find: "zh", replace: "(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))", rules: [] },
                    {
                        find: "zz",
                        replace: "((হ্য)|((জ|য|(জ়)|([‌‍]?্য))্?((জ|য|(জ়)|([‌‍]?্য)))?))",
                        rules: [],
                    },
                    { find: "z", replace: "(জ|য|(জ়)|([‌‍]?্য))", rules: [] },
                    { find: "0", replace: "(০|(0)|(শূন্য))", rules: [] },
                    { find: "1", replace: "(১|(1)|(এক))", rules: [] },
                    { find: "2", replace: "(২|(2)|(দুই))", rules: [] },
                    { find: "3", replace: "(৩|(3)|(তিন))", rules: [] },
                    { find: "4", replace: "(৪|(4)|(চার))", rules: [] },
                    { find: "5", replace: "(৫|(5)|(পাঁচ))", rules: [] },
                    { find: "6", replace: "((6)|৬|(ছয়))", rules: [] },
                    { find: "7", replace: "(৭|(7)|(সাত))", rules: [] },
                    { find: "8", replace: "(৮|(8)|(আট))", rules: [] },
                    { find: "9", replace: "(৯|(9)|(নয়))", rules: [] },
                    { find: "`", replace: "", rules: [] },
                ],
                vowel: "aeiou",
                consonant: "bcdfghjklmnpqrstvwxyz",
                ignore: "|()[]{}^$*+?.~!@#%&-_='\";<>/\\,:`",
            },
        }),\n\nvar DBSearch = function(avrodict, AvroRegex) { this.avrodict = avrodict; this.AvroRegex = AvroRegex; this._init && this._init.apply(this, arguments); };\nDBSearch.prototype = {search: function (e) {
                var t = [];
                switch (e.toLowerCase().charAt(0)) {
                    case "a":
                        t = "a aa e oi o nya y".split(" ");
                        break;
                    case "b":
                        t = ["b", "bh"];
                        break;
                    case "c":
                        t = ["c", "ch", "k"];
                        break;
                    case "d":
                        t = ["d", "dh", "dd", "ddh"];
                        break;
                    case "e":
                        t = ["i", "ii", "e", "y"];
                        break;
                    case "f":
                        t = ["ph"];
                        break;
                    case "g":
                        t = ["g", "gh", "j"];
                        break;
                    case "h":
                        t = ["h"];
                        break;
                    case "i":
                        t = ["i", "ii", "y"];
                        break;
                    case "j":
                        t = ["j", "jh", "z"];
                        break;
                    case "k":
                        t = ["k", "kh"];
                        break;
                    case "l":
                        t = ["l"];
                        break;
                    case "m":
                        t = ["h", "m"];
                        break;
                    case "n":
                        t = ["n", "nya", "nga", "nn"];
                        break;
                    case "o":
                        t = "a u uu oi o ou y".split(" ");
                        break;
                    case "p":
                        t = ["p", "ph"];
                        break;
                    case "q":
                        t = ["k"];
                        break;
                    case "r":
                        t = ["rri", "h", "r", "rr", "rrh"];
                        break;
                    case "s":
                        t = ["s", "sh", "ss"];
                        break;
                    case "t":
                        t = ["t", "th", "tt", "tth", "khandatta"];
                        break;
                    case "u":
                        t = ["u", "uu", "y"];
                        break;
                    case "v":
                        t = ["bh"];
                        break;
                    case "w":
                        t = ["o"];
                        break;
                    case "x":
                        t = ["e", "k"];
                        break;
                    case "y":
                        t = ["i", "y"];
                        break;
                    case "z":
                        t = ["h", "j", "jh", "z"];
                }
                ((e = this._regex.parse(e)), (e = "^" + e + "$"));
                var n = [];
                for (i in t)
                    n = n.concat(this._searchInArray(e, h.tables["w_" + t[i]]));
                return n;
            },
            _searchInArray: function (e, t) {
                var n = [],
                    r = "",
                    i = RegExp(e);
                for (w in t) ((r = t[w]), i.test(r) && n.push(r));
                return n;
            },
            _printWords: function (e) {
                e = this.search(e);
                for (w in e) console.log(e[w]);
            },
            _init: function () {
                this._regex = new d.AvroRegex();
            },
        }),\n\nvar SuggestionBuilder = function(dbsearch, autocorrect, suffixdict, levenshtein) { this.v = dbsearch; this.m = autocorrect; this.y = suffixdict; this.g = levenshtein; this._init && this._init.apply(this, arguments); };\nSuggestionBuilder.prototype = {FAIL_START